Revit 2027 API
ParameterValueProvider Properties
The ParameterValueProvider type exposes the following members.
Properties
Name | Description
IsValidObject |  Specifies whether the .NET object represents a valid Revit entity.
(Inherited from FilterableValueProvider)
Parameter |  The parameter used to provide a string, integer, double-precision, or ElementId value on request for a given element.
Top
See Also
Reference
ParameterValueProvider Class
Autodesk.Revit.DB Namespace